tap "gromgit/fuse"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
brew "act"
brew "xz"
brew "zstd"
brew "jpeg-xl"
brew "aom"
brew "gdbm"
brew "perl"
brew "asciiquarium"
brew "gettext"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "python@3.12"
brew "automake"
brew "awscli"
brew "bash"
brew "bat"
brew "bear"
brew "bison"
brew "boost"
brew "cairo"
brew "coreutils"
brew "emacs"
brew "tree-sitter"
brew "cask"
brew "ccache"
brew "cfssl"
brew "librsvg"
brew "chafa"
brew "chezmoi"
brew "chruby"
brew "cmake"
brew "gcc"
brew "pkgconf"
brew "imagemagick"
brew "libarchive"
brew "copyparty"
brew "cowsay"
brew "cscope"
brew "ctags"
brew "curl"
brew "dash-shell"
brew "ddgr"
brew "docker"
brew "doxygen"
brew "eza"
brew "fd"
brew "figlet"
brew "fish"
brew "fontforge"
brew "fortune"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-filter-repo"
brew "go"
brew "grip"
brew "grpc"
brew "gsl"
brew "gtk+"
brew "gtkmm"
brew "htop"
brew "htslib"
brew "hugo"
brew "icu4c@76"
brew "ipython"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "lftp"
brew "libffi"
brew "libxlsxwriter"
brew "libyaml"
brew "lolcat"
brew "mercurial"
brew "mole"
brew "zlib"
brew "mysql"
brew "ninja"
brew "node"
brew "ocaml"
brew "opam"
brew "openjdk"
brew "pandoc"
brew "pipx"
brew "prettier"
brew "pyvim"
brew "qt"
brew "qt@5"
brew "r"
brew "ripgrep"
brew "ruby-install"
brew "sdl2"
brew "shfmt"
brew "siege"
brew "spotify_player"
brew "telnet"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vim"
brew "vint"
brew "wget"
brew "wireshark"
brew "yajl"
brew "yarn"
brew "zoxide"
brew "zsh-completions"
brew "gromgit/fuse/s3fs-mac"
cask "basictex"
cask "ghostty@tip"
cask "macfuse"
cask "notunes"
cask "quarto"
cask "scroll-reverser"
cask "skim"
cargo "bottom"
cargo "cargo-update"
cargo "du-dust"
cargo "hexyl"
cargo "pokeget"
cargo "procs"
cargo "so"
cargo "tealdeer"
cargo "tokei"
