brew "aom"	# Codec library for encoding and decoding AV1 video streams
brew "apfel"	# Apple Intelligence from the command-line, with OpenAi-compatible API server
brew "automake"	# Tool for generating GNU Standards-compliant Makefiles
brew "awscli"	# Official Amazon AWS command-line interface
brew "bash-language-server"	# Language Server for Bash
brew "bat"	# Clone of cat(1) with syntax highlighting and Git integration
brew "bear"	# Generate compilation database for clang tooling
brew "bison"	# Parser generator
brew "boost"	# Collection of portable C++ source libraries
brew "broot"	# New way to see and navigate directory trees
brew "cairo"	# Vector graphics library with cross-device output support
brew "cask"	# Emacs dependency management
brew "ccache"	# Object-file caching compiler wrapper
brew "cfssl"	# CloudFlare's PKI toolkit
brew "chafa"	# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chezmoi"	# Manage your dotfiles across multiple diverse machines, securely
brew "chruby"	# Ruby environment tool
brew "cmake"	# Cross-platform make
brew "coreutils"	# GNU File, Shell, and Text utilities
brew "cowsay"	# Apjanke's fork of the classic cowsay project
brew "cscope"	# Tool for browsing source code
brew "ctags"	# Reimplementation of ctags(1)
brew "curl"	# Get a file from an HTTP, HTTPS or FTP server
brew "ddgr"	# DuckDuckGo from the terminal
brew "docker"	# Pack, ship and run any application as a lightweight container
brew "doxygen"	# Generate documentation for several programming languages
brew "duckdb"	# Embeddable SQL OLAP Database Management System
brew "eza"	# Modern, maintained replacement for ls
brew "fd"	# Simple, fast and user-friendly alternative to find
brew "figlet"	# Banner-like program prints strings as ASCII art
brew "fish-lsp"	# LSP implementation for the fish shell language
brew "fish"	# User-friendly command-line shell for UNIX-like operating systems
brew "fortune"	# Infamous electronic fortune-cookie generator
brew "fzf"	# Command-line fuzzy finder written in Go
brew "gawk"	# GNU awk utility
brew "gcc"	# GNU compiler collection
brew "gdbm"	# GNU database manager
brew "gettext"	# GNU internationalization (i18n) and localization (l10n) library
brew "gh"	# GitHub command-line tool
brew "ghostscript"	# Interpreter for PostScript and PDF
brew "git-filter-repo"	# Quickly rewrite git repository history
brew "gnumeric"	# GNOME Spreadsheet Application
brew "go"	# Open source programming language to build simple/reliable/efficient software
brew "grip"	# GitHub Markdown previewer
brew "grpc"	# Next generation open source RPC library and framework
brew "gsl"	# Numerical library for C and C++
brew "gtk+"	# GUI toolkit
brew "htop"	# Improved top (interactive process viewer)
brew "htslib"	# C library for high-throughput sequencing data formats
brew "hugo"	# Configurable static site generator
brew "imagemagick"	# Tools and libraries to manipulate images in select formats
brew "jpeg-xl"	# New file format for still image compression
brew "just"	# Handy way to save and run project-specific commands
brew "lazydocker"	# Lazier way to manage everything docker
brew "lazygit"	# Simple terminal UI for git commands
brew "lftp"	# Sophisticated file transfer program
brew "libarchive"	# Multi-format archive and compression library
brew "libffi"	# Portable Foreign Function Interface library
brew "librsvg"	# Library to render SVG files using Cairo
brew "libxlsxwriter"	# C library for creating Excel XLSX files
brew "libyaml"	# YAML Parser
brew "lolcat"	# Rainbows and unicorns in your console!
brew "lua-language-server"	# Language Server for the Lua language
brew "mole"	# Deep clean and optimize your Mac
brew "mysql"	# Open source relational database management system
brew "ninja"	# Small build system for use with gyp or CMake
brew "node"	# Open-source, cross-platform JavaScript runtime environment
brew "ocaml"	# General purpose programming language in the ML family
brew "openjdk"	# Development kit for the Java programming language
brew "openssl@3"	# Cryptography and SSL/TLS Toolkit
brew "pandoc"	# Swiss-army knife of markup format conversion
brew "pipx"	# Execute binaries from Python packages in isolated environments
brew "pkgconf"	# Package compiler and linker metadata toolkit
brew "postgresql@17", link: true	# Object-relational database system
brew "prettier"	# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "python@3.12"	# Interpreted, interactive, object-oriented programming language
brew "qt"	# Cross-platform application and UI framework
brew "r"	# Software environment for statistical computing
brew "rclone"	# Rsync for cloud storage
brew "readline"	# Library for command-line editing
brew "ripgrep"	# Search tool like grep and The Silver Searcher
brew "ruby-install"	# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruff"	# Extremely fast Python linter, written in Rust
brew "sdl2-compat"	# SDL2 compatibility layer that uses SDL3 behind the scenes
brew "shellharden"	# Bash syntax highlighter that encourages/fixes variables quoting
brew "shfmt"	# Autoformat shell script source code
brew "siege"	# HTTP regression testing and benchmarking utility
brew "sqlite"	# Command-line interface for SQLite
brew "starship"	# Cross-shell prompt for astronauts
brew "stylua"	# Opinionated Lua code formatter
brew "tealdeer"	# Very fast implementation of tldr in Rust
brew "telnet"	# User interface to the TELNET protocol
brew "thefuck"	# Programmatically correct mistyped console commands
brew "tmux"	# Terminal multiplexer
brew "tombi"	# TOML formatter, linter and language server
brew "tree-sitter-cli"	# Parser generator tool
brew "tree-sitter"	# Incremental parsing library
brew "tree"	# Display directories as trees (with optional color/HTML output)
brew "ts_query_ls"	# LSP implementation for Tree-sitter's query files
brew "uv"	# Extremely fast Python package installer and resolver, written in Rust
brew "wget"	# Internet file retriever
brew "wireshark"	# Network analyzer and capture tool - without graphical user interface
brew "xz"	# General-purpose data compression with high compression ratio
brew "yajl"	# Yet Another JSON Library
brew "yaml-language-server"	# Language Server for Yaml Files
brew "yarn"	# JavaScript package manager
brew "zig"	# Programming language designed for robustness, optimality, and clarity
brew "zlib"	# General-purpose lossless data-compression library
brew "zoxide"	# Shell extension to navigate your filesystem faster
brew "zsh-completions"	# Additional completion definitions for zsh
brew "zstd"	# Zstandard is a real-time compression algorithm
cargo "cargo-generate"	
cask "claude-code"	# Terminal-based AI coding assistant
cask "claude"	# Anthropic's official Claude AI desktop app
cask "copilot-cli"	# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-language-server"	# Language Server Protocol server for GitHub Copilot
cask "db-browser-for-sqlite"	# Browser for SQLite databases
cask "firefox"	# Web browser
cask "ghostty"	# Terminal emulator that uses platform-native UI and GPU acceleration
cask "libreoffice"	# Free cross-platform office suite, fresh version
cask "macfuse"	# File system integration
cask "mactex-no-gui"	# Full TeX Live distribution without GUI applications
cask "notunes"	# Simple application that will prevent iTunes or Apple Music from launching
cask "openrefine"	# Tool for working with messy data (previously Google Refine)
cask "quarto"	# Scientific and technical publishing system built on Pandoc
cask "scroll-reverser"	# Tool to reverse the direction of scrolling
cask "skim"	# PDF reader and note-taking application
cask "sshfs-mac"	# Network filesystem client to connect to SSH servers
cask "temurin"	# JDK from the Eclipse Foundation (Adoptium)
npm "pnpm"	
tap "aws/tap", trusted: true
tap "ewhauser/tap", trusted: true	
tap "gromgit/fuse", trusted: true	
uv "semble"	
